Revit 2024 API
BuiltInFailures.StairRampFailures.StringerCurvesNotSplitStairs Property
 The slope of stringer may not parallel runs and landings. To get a parallel stringer, split boundary lines at the ends of landings.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId StringerCurvesNotSplitStairs { get; }
Visual Basic
Public Shared ReadOnly Property StringerCurvesNotSplitStairs As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ StringerCurvesNotSplitStairs {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace